Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Сотрудники</Name>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сотрудники/Forms/НалогНаДоходы/Ext/Form/Module.bsl
&НаСервере
Процедура ДБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПолеВвода = Элементы.Добавить(
		"ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо",    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		ЭтаФорма.Элементы["СтатусНалогоплательщикаГруппа"]);	      //Контейнер для поля ввода (Форма,Группа,Страница)
			
	ПолеВвода.Заголовок = "Действует до";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо";
		
	// Подготовить структуру отбора по измерениям     
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицоСсылка);
	// Получить структуру с данными ресурсов записи
	СтруктураРесурсов = РегистрыСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.Получить(СтруктураОтбора);
	ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо = СтруктураРесурсов.ДействуетДо;
	
КонецПроцедуры


Процедура СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛЗаписатьНаСервере(ФизическоеЛицо, ДействуетДо)
	Запись = РегистрыСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.СоздатьМенеджерЗаписи();
	Запись.ФизическоеЛицо = ФизическоеЛицо;
	Запись.ДействуетДо = ДействуетДо;
	Запись.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ДБ_ОкПосле(Команда)
	СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛЗаписатьНаСервере(ФизическоеЛицоСсылка, ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо);
КонецПроцедуры
